In [1]:
import pandas as pd

In [3]:
#Q1
a =pd.Series([4,8,15,16,23,42])
print(a)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [5]:
#Q2
p = ['ravi','aman','prince','kunal','rohit','srk','aamir','tiger','archit','nishant']
pd.Series(p)

0       ravi
1       aman
2     prince
3      kunal
4      rohit
5        srk
6      aamir
7      tiger
8     archit
9    nishant
dtype: object

In [9]:
#Q3

df = pd.DataFrame({'Name':['Alice','Bob','Claire'],
              'Age':[25,30,27],
              'Gender':['Female','Male','Female']})

df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [10]:
#Q4
# DataFrame is a two-dimensional labeled data structure that consists of columns, which can be of different data types
# (such as integers, floats, strings, etc.). It is similar to a table or a spreadsheet in which data is organized in rows and columns.
# Series is a one-dimensional labeled array that can hold data of any type. It is similar to a single column of a DataFrame or
# a simple array or list. Series objects have both row labels (the index) and column labels (the values).

In [11]:
# Creating a Series
population = pd.Series([1000000, 1500000, 800000, 1200000])
population

0    1000000
1    1500000
2     800000
3    1200000
dtype: int64

In [13]:
# Creating a DataFrame
data = {'City': ['New York', 'Los Angeles', 'Chicago', 'Houston','india','america','dubai','germany'],
        'Population': [1000000, 1500000, 800000, 1200000,2200000,3400090,239999,90000000]}

df = pd.DataFrame(data)
df

          City  Population
0     New York     1000000
1  Los Angeles     1500000
2      Chicago      800000
3      Houston     1200000
4        india     2200000
5      america     3400090
6        dubai      239999
7      germany    90000000

In [15]:
#Q5

#1)head() and tail()
df.head()  # Returns the first 5 rows of the DataFrame

          City  Population
0     New York     1000000
1  Los Angeles     1500000
2      Chicago      800000
3      Houston     1200000
4        india     2200000

In [17]:
df.tail()  # Returns the last  5 rows of the DataFrame

      City  Population
3  Houston     1200000
4    india     2200000
5  america     3400090
6    dubai      239999
7  germany    90000000

In [19]:
# describe()
df.describe()

         Population
count  8.000000e+00
mean   1.254251e+07
std    3.131242e+07
min    2.399990e+05
25%    9.500000e+05
50%    1.350000e+06
75%    2.500022e+06
max    9.000000e+07

In [21]:
# sort_values
df_sorted = df.sort_values('Population')  # Sorts the DataFrame based on the 'Population' column
df_sorted

          City  Population
6        dubai      239999
2      Chicago      800000
0     New York     1000000
3      Houston     1200000
1  Los Angeles     1500000
4        india     2200000
5      america     3400090
7      germany    90000000

In [22]:
# and many more like drop, reindex,apply,rolling,mean,mode,etc.

In [23]:
#Q6
# both Series and DataFrame are mutable in nature, allowing you to modify their contents, while Panel can also
# be modified, but its usage has been deprecated in favor of other structures like MultiIndex DataFrame.

In [24]:
#Q7
import pandas as pd

# Create individual Series
name_series = pd.Series(['Alice', 'Bob', 'Charlie'])
age_series = pd.Series([25, 30, 35])
city_series = pd.Series(['New York', 'London', 'Tokyo'])

# Create DataFrame using the Series
data = {
    'Name': name_series,
    'Age': age_series,
    'City': city_series
}

df = pd.DataFrame(data)

In [25]:
df

      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35     Tokyo